/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "No se ha podido completar la operación";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Se ha producido un error desconocido (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "No se puede completar la acción";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Inténtelo más tarde.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "No se puede grabar";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "No se puede grabar";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Detenga las otras acciones que usen el %@ e inténtelo de nuevo."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "No se puede grabar";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operación detenida";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "No hay suficiente espacio disponible para continuar escribiendo en el archivo. Libere espacio eliminando vídeos o fotos existentes.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Se ha alcanzado la duración máxima de la grabación."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Se ha alcanzado el tamaño máximo de la grabación."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Detenga las otras acciones que usen el dispositivo de grabación e inténtelo de nuevo.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Se ha alcanzado la duración máxima de la grabación."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "No se puede grabar";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Intente grabar de nuevo.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "No se puede usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Detenga las otras acciones que usen el %@ e inténtelo de nuevo."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "No se puede usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Detenga las otras acciones que usen el %@ e inténtelo de nuevo."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Grabación detenida";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Detenga las otras acciones que usen el dispositivo de grabación e inténtelo de nuevo.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "No se puede completar la acción";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Inténtelo más tarde.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "No se puede completar la exportación";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Intente exportar de nuevo.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "No se puede descodificar";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "No se han podido descodificar los datos de contenido. Puede que estén dañados.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "El formato del contenido no es compatible.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "No se puede guardar";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Intente guardar de nuevo.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Este contenido no puede usarse.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Este contenido no puede usarse.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Este contenido no puede usarse.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Este contenido no puede usarse.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "El formato del contenido no es compatible.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Puede que el contenido esté dañado.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "No se pueden hacer fotos";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Intente hacer una foto de nuevo.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operación detenida";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "El contenido protegido no admite esta operación."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Este contenido no está autorizado."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Esta aplicación no tiene autorización para reproducir este archivo."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Este contenido no puede usarse.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "No se puede descodificar";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "No se encuentra el descodificador necesario para este contenido.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "No se puede codificar";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "No se encuentra el codificador necesario para este contenido.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "No se puede descodificar";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "El descodificador necesario para este contenido está en uso.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Detenga las otras acciones que descodifiquen contenido e inténtelo de nuevo.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "No se puede codificar";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "El codificador necesario para este contenido está en uso.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Detenga las otras acciones que codifiquen contenido e inténtelo de nuevo.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "No se puede usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Las aplicaciones que se estén ejecutando en segundo plano no pueden usar %@."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operación detenida";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Este contenido no admite esta operación.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operación detenida";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "No se ha podido crear el vídeo conforme a las instrucciones proporcionadas.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "No se puede abrir";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Este contenido no puede usarse.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operación detenida";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "No se puede usar el archivo de la caché de la URL de descarga.";
